#### Terraform Plan - DEV 🌍
  <details><summary>Show Plan</summary>
  
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "dev-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + local_account_disabled              = true
      + location                            = "eastus"
      + name                                = "dev-aks"
      + node_resource_group                 = "dev-rg-workload-aks-nodes"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.Network/privateDnsZones/privatelink.eastus.azmk8s.io"
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "dev-rg-workload"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = 110
          + min_count            = 2
          + name                 = "system"
          + node_count           = 2
          + node_labels          = {
              + "environment"   = "dev"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 128
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = {
              + "CostCenter"  = "IT-Development"
              + "Environment" = "dev"
              + "ManagedBy"   = "Terraform"
              + "Project"     = "azureapp"
            }
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D4s_v3"
          + vnet_subnet_id       = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-workload/providers/Microsoft.Network/virtualNetworks/dev-vnet-workload/subnets/snet-aks"
          + workload_runtime     = (known after apply)
          + zones                = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-workload/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-aks-uai",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = (known after apply)
          + ingress_application_gateway_identity = (known after apply)
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 2,
                  + 3,
                  + 4,
                ]
            }
        }

      + microsoft_defender {
          + log_analytics_workspace_id = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.OperationalInsights/workspaces/dev-law"
        }

      + network_profile {
          + dns_service_ip          = "10.2.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.2.0.0/16"
          + service_cidrs           = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.OperationalInsights/workspaces/dev-law"
          + oms_agent_identity         = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.user[0] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "user" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 110
      + min_count             = 2
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 2
      + node_labels           = {
          + "environment"   = "dev"
          + "nodepool-type" = "user"
          + "nodepoolos"    = "linux"
        }
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4s_v3"
      + vnet_subnet_id        = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-workload/providers/Microsoft.Network/virtualNetworks/dev-vnet-workload/subnets/snet-aks"
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.OperationalInsights/workspaces/dev-law"
      + name                           = "diag-dev-aks"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "cluster-autoscaler"
        }
      + enabled_log {
          + category = "kube-apiserver"
        }
      + enabled_log {
          + category = "kube-audit"
        }
      + enabled_log {
          + category = "kube-controller-manager"
        }
      + enabled_log {
          + category = "kube-scheduler"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_role_assignment.agic_appgw_contributor[0] will be created
  + resource "azurerm_role_assignment" "agic_appgw_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50f89d9e-1ba3-4a66-9b6e-fca6d2f18d17"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_role_assignment.agic_appgw_rg_reader[0] will be created
  + resource "azurerm_role_assignment" "agic_appgw_rg_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "50f89d9e-1ba3-4a66-9b6e-fca6d2f18d17"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.appgw.azurerm_application_gateway.this will be created
  + resource "azurerm_application_gateway" "this" {
      + enable_http2                = true
      + firewall_policy_id          = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/dev-waf-policy"
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "dev-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "dev-rg-hub"
      + tags                        = {
          + "CostCenter"      = "IT-Development"
          + "Environment"     = "dev"
          + "ManagedBy"       = "Terraform"
          + "Project"         = "azureapp"
          + "environment"     = "dev"
          + "managed_by_agic" = "true"
        }
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 3
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "default-backend"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default-http-setting"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "default-health-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []

          + connection_draining {
              + drain_timeout_sec = 60
              + enabled           = true
            }
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default-https-setting"
          + pick_host_name_from_backend_address = true
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "default-https-probe"
          + protocol                            = "Https"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []

          + connection_draining {
              + drain_timeout_sec = 60
              + enabled           = true
            }
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appgw-frontend-public"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.Network/publicIPAddresses/dev-appgw-pip"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "frontendPort443"
          + port = 443
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "frontendPort80"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "appgw-ipcfg"
          + subnet_id = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.Network/virtualNetworks/dev-vnet-hub/subnets/snet-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appgw-frontend-public"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "frontendPort80"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-appgw-uai",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "default-health-probe"
          + path                                      = "/healthz"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "default-https-probe"
          + path                                      = "/healthz"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "default-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "default-http-setting"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "http-listener"
          + id                         = (known after apply)
          + name                       = "rule1"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Prevention"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }
    }

  # module.appgw.azurerm_monitor_diagnostic_setting.appgw[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "appgw" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.OperationalInsights/workspaces/dev-law"
      + name                           = "diag-dev-appgw"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ApplicationGatewayAccessLog"
        }
      + enabled_log {
          + category = "ApplicationGatewayFirewallLog"
        }
      + enabled_log {
          + category = "ApplicationGatewayPerformanceLog"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "dev-fd-endpoint"
      + tags                     = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_firewall_policy.waf will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      + custom_block_response_status_code = 403
      + enabled                           = true
      + frontend_endpoint_ids             = (known after apply)
      + id                                = (known after apply)
      + mode                              = "Prevention"
      + name                              = "devfdwafpolicy"
      + request_body_check_enabled        = true
      + resource_group_name               = "dev-rg-hub"
      + sku_name                          = "Standard_AzureFrontDoor"
      + tags                              = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "RateLimitRule"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 100
          + type                           = "RateLimitRule"

          + match_condition {
              + match_values       = [
                  + "0.0.0.0/0",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "IPMatch"
            }
        }

      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_DefaultRuleSet"
          + version = "2.1"
        }
      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_BotManagerRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "135.237.74.243"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "dev-origin"
      + origin_host_header             = "135.237.74.243"
      + priority                       = 1
      + weight                         = 1000
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin_group.og will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "og" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "dev-origin-group"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 30
          + path                = "/healthz"
          + protocol            = "Https"
          + request_type        = "GET"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.fd will be created
  + resource "azurerm_cdn_frontdoor_profile" "fd" {
      + id                       = (known after apply)
      + name                     = "dev-fd"
      + resource_group_name      = "dev-rg-hub"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_route.route will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "dev-route"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.frontdoor.azurerm_cdn_frontdoor_security_policy.security will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "dev-security-policy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.frontdoor.azurerm_monitor_diagnostic_setting.fd[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "fd" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.OperationalInsights/workspaces/dev-law"
      + name                           = "diag-dev-fd"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontDoorAccessLog"
        }
      + enabled_log {
          + category = "FrontDoorHealthProbeLog"
        }
      + enabled_log {
          + category = "FrontDoorWebApplicationFirewallLog"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.keyvault.azurerm_key_vault.this will be updated in-place
  ~ resource "azurerm_key_vault" "this" {
        id                              = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.KeyVault/vaults/dev-kv-dev01"
        name                            = "dev-kv-dev01"
      ~ tags                            = {
            "CostCenter"  = "IT-Development"
          ~ "Environment" = "dev-rg-hub" -> "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "azureapp"
          + "environment" = "dev-rg-hub"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keyvault.azurerm_key_vault_key.cmk[0] will be created
  + resource "azurerm_key_vault_key" "cmk" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.KeyVault/vaults/dev-kv-dev01"
      + n                       = (known after apply)
      + name                    = "dev-kv-dev01-cmk"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)

      + rotation_policy {
          + expire_after         = "P90D"
          + notify_before_expiry = "P29D"

          + automatic {
              + time_before_expiry = "P30D"
            }
        }
    }

  # module.network.azurerm_resource_group.hub will be updated in-place
  ~ resource "azurerm_resource_group" "hub" {
        id       = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub"
        name     = "dev-rg-hub"
      ~ tags     = {
            "CostCenter"  = "IT-Development"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "azureapp"
          + "environment" = "dev"
            "tier"        = "hub"
        }
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_resource_group.spoke_rg["workload"] will be updated in-place
  ~ resource "azurerm_resource_group" "spoke_rg" {
        id       = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-workload"
        name     = "dev-rg-workload"
      ~ tags     = {
            "CostCenter"  = "IT-Development"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "azureapp"
          + "environment" = "dev"
            "tier"        = "spoke-workload"
        }
        # (1 unchanged attribute hidden)
    }

  # module.sql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.sql.azurerm_key_vault_secret.sql_admin_password[0] will be created
  + resource "azurerm_key_vault_secret" "sql_admin_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.KeyVault/vaults/dev-kv-dev01"
      + name                    = "sql-admin-password-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sql.azurerm_monitor_diagnostic_setting.sql_database[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "sql_database" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.OperationalInsights/workspaces/dev-law"
      + name                           = "diag-appdb"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AutomaticTuning"
        }
      + enabled_log {
          + category = "Blocks"
        }
      + enabled_log {
          + category = "DatabaseWaitStatistics"
        }
      + enabled_log {
          + category = "Deadlocks"
        }
      + enabled_log {
          + category = "Errors"
        }
      + enabled_log {
          + category = "QueryStoreRuntimeStatistics"
        }
      + enabled_log {
          + category = "QueryStoreWaitStatistics"
        }
      + enabled_log {
          + category = "SQLInsights"
        }
      + enabled_log {
          + category = "Timeouts"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.sql.azurerm_monitor_diagnostic_setting.sql_server[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "sql_server" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.OperationalInsights/workspaces/dev-law"
      + name                           = "diag-dev-sql"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "DevOpsOperationsAudit"
        }
      + enabled_log {
          + category = "SQLSecurityAuditEvents"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.sql.azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 50
      + min_capacity                                               = (known after apply)
      + name                                                       = "appdb"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = false
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "S0"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false

      + long_term_retention_policy {
          + immutable_backups_enabled = false
          + monthly_retention         = "P1M"
          + week_of_year              = 1
          + weekly_retention          = "P1W"
          + yearly_retention          = (known after apply)
        }

      + short_term_retention_policy {
          + backup_interval_in_hours = 12
          + retention_days           = 7
        }
    }

  # module.sql.azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                  = "sqladmin"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "eastus"
      + minimum_tls_version                  = "1.2"
      + name                                 = "dev-sql"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = false
      + resource_group_name                  = "dev-rg-workload"
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + version                              = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = (known after apply)
          + login_username              = "sqladmin"
          + tenant_id                   = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.sql.azurerm_mssql_server_extended_auditing_policy.main will be created
  + resource "azurerm_mssql_server_extended_auditing_policy" "main" {
      + audit_actions_and_groups                = (known after apply)
      + enabled                                 = true
      + id                                      = (known after apply)
      + log_monitoring_enabled                  = true
      + retention_in_days                       = 90
      + server_id                               = (known after apply)
      + storage_account_access_key_is_secondary = false
    }

  # module.sql.azurerm_mssql_server_security_alert_policy.main will be created
  + resource "azurerm_mssql_server_security_alert_policy" "main" {
      + email_account_admins = true
      + id                   = (known after apply)
      + resource_group_name  = "dev-rg-workload"
      + retention_days       = 30
      + server_name          = "dev-sql"
      + state                = "Enabled"
    }

  # module.sql.azurerm_mssql_server_transparent_data_encryption.main[0] will be created
  + resource "azurerm_mssql_server_transparent_data_encryption" "main" {
      + auto_rotation_enabled = false
      + id                    = (known after apply)
      + server_id             = (known after apply)
    }

  # module.sql.azurerm_private_endpoint.sql[0] will be created
  + resource "azurerm_private_endpoint" "sql" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "pe-dev-sql"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dev-rg-workload"
      + subnet_id                = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-workload/providers/Microsoft.Network/virtualNetworks/dev-vnet-workload/subnets/snet-db"
      + tags                     = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = [
              + "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-dev-sql"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlServer",
            ]
        }
    }

  # module.sql.random_password.sql_admin will be created
  + resource "random_password" "sql_admin" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 1
      + min_numeric      = 1
      + min_special      = 1
      + min_upper        = 1
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.storage.azurerm_monitor_diagnostic_setting.storage[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storage" {
        id                         = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub/providers/Microsoft.Storage/storageAccounts/devtfstateacctdev01/blobServices/default|diag-devtfstateacctdev01"
        name                       = "diag-devtfstateacctdev01"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true
        }

        # (6 unchanged blocks hidden)
    }

  # module.storage.azurerm_storage_container.tfstate will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "tfstate"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "devtfstateacctdev01"
    }

Plan: 27 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  + aks_cluster_fqdn                       = (known after apply)
  + appgw_id                               = (known after apply)
  + frontdoor_endpoint_hostname            = (known after apply)
  + sql_server_fqdn                        = (known after apply)

  ```
  
  </details>
  
  *Pusher: @suddhasish, Action: `pull_request`*